app/controllers/typos_controller.rb

INSERT INTO "typos" ("created_at", "domain_id", "status", "updated_at", "url") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-09-13 20:01:51.361716"], ["domain_id", 1], ["status", "READY_FOR_EMAIL"], ["updated_at", "2014-09-13 20:01:51.361716"], ["url", "asdf"]]
---
  def create
    @typo = Typo.save_new(typo_params)